/**
  *****************************************************************************
  *                           系统串口设置相关的函数
  *
  *                       (C) Copyright 2000-2020, ***
  *                            All Rights Reserved
  *****************************************************************************
**/

#ifndef _usart_h
#define _usart_h


/**
  ****************************** Support C++ **********************************
**/
#ifdef __cplusplus
	extern "C"{
#endif		
/**
  *****************************************************************************
**/
		

/******************************************************************************
                               外部函数头文件                        
******************************************************************************/

#include <stdio.h>	//printf函数头文件

#include "../sys_msp430/sys_def.h"

/******************************************************************************
                         定义串口是否接受外部数据
******************************************************************************/

#define Printf_Support_En                        1  //是否支持C标准库printf（）函数
                                                    // 0: 不支持
                                                    // 1: 支持
#define __ICCARM__              1

#define EN_USART1_RX                             1  //串口接收使能。0：禁止接收
                                                    //             1：允许接收
#define USART_REC_LEN                            200  //定义最大接收字节数
#define USART1_REC_LEN                            20   //定义uart1最大接收字节数

/******************************************************************************
                              外部调用功能函数
******************************************************************************/


extern uint8_t  USART_RX_BUF[USART_REC_LEN];  //接收缓冲,最大USART_REC_LEN个字节
extern uint16_t USART_RX_STA;	//接收状态标记

extern uint8_t  USART1_RX_BUF[20];  //接收缓冲,最大USART_REC_LEN个字节
extern uint16_t USART1_RX_STA;	//接收状态标记


void uart_init                                   (uint32_t bound);  //初始化IO 串口

#if Printf_Support_En == 1
void uart_sendbyte                               (uint8_t byte);  //串口发送一个字节
void uart_senfstring                             (uint8_t * str);  //串口发送字符串
void uart_printf                                 (char *format, ...);  //串口格式化打印
#endif


/**
  ****************************** Support C++ **********************************
**/
#ifdef __cplusplus
	}
#endif
/**
  *****************************************************************************
**/


#endif  /* end usart.h */

